
// constants.ts: Глобальные константы игры

export const TILE_SIZE = 40;
export const INVENTORY_SIZE = 36; // 9 хотбар + 27 рюкзак
export const HOTBAR_SIZE = 9;

// Иконки предметов
export const ICONS: Record<string, string> = {
    // Basic
    'stick': '🥢',       // Палка (с земли)
    'pebble': '⚪',      // Галька (с земли)
    
    // Tier 1
    'sharp_pebble': '🔺', // Острая галька (для добычи камня)
    
    // Resources
    'rock': '🪨',        // Камень (из валуна)
    'wood': '🪵',        // Бревна (из дерева)
    'bark': '📜',        // Кора (с дерева рубилом)
    
    // Tier 2
    'sharp_rock': '🔪',  // Рубило (для коры)
    'rope': '➰',        // Веревка
    
    // Tier 3
    'stone_axe': '🪓',   // Топор
    'plank': '🟫',
    'workbench': '🪚',
    
    // Armor
    'iron_helm': '🪖',
    'iron_chest': '👕',
    'iron_legs': '👖',
    
    'default': '❓'
};
